# TooShortStackedWall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..TooShortStackedWall Property
BuiltInFailures..::..WallFailures Class See Also
---
Stacked wall instance is too short.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TooShortStackedWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TooShortStackedWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TooShortStackedWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace